back/app/controllers/api/v1/citizens_controller.rb

SELECT "citizens".* FROM "citizens"
---
      def index
        offset = (params[:offset] || 0).to_i
        limit = (params[:limit] || DEFAULT_PAGE_SIZE).to_i
        query = params[:query] || '*'
        citizens = Citizen.search(query, limit: limit, offset: offset)